<?php

// Напишете php програмка, която извежда факториела на  5, 8 и 10. 
// (Факториел на число е произведението на всички цели числа от 1 до него, 
// включително. Пример: факториел 5 е равен на 1 * 2 * 3 * 4 * 5.)


//Въвеждаме променлива numberFive, което е равно на 5
$numberFive = 5;
//Въвеждаме променлива factFive, което е равно на 1
$factFive = 1;
//Правим проверка докато  числото 5 е по-голямо от 1
while($numberFive > 1){
// да изчисли факториела, тоест умножаваме числото 1 по 5
    $factFive *= $numberFive;
//Декрементираме броя на итерациите, т.е понижаваме числото с единица,
// т.е става 4
    $numberFive--;   
}
//Когато приключи проверката, т.е 0>1 излизаме от цикъла и отпечатваме на 
//екрана умножението на числата от 1 до 5
echo 'Факториел на числото 5 (1*2*3*4*5) е: ' .  $factFive . '<br />';


//Въвеждаме променлива numberEight, което е равно на 8
$numberEight = 8;
//Въвеждаме променлива factEight, което е равно на 1
$factEight = 1;
//Правим проверка докато  числото 8 е по-голямо от 1
while($numberEight > 1){
// да изчисли факториела, тоест умножаваме числото 1 по 8    
    $factEight *= $numberEight;
//Декрементираме броя на итерациите, т.е понижаваме числото с единица,
// т.е става 7
    $numberEight--;   
}
//Когато приключи проверката, т.е 0>1 излизаме от цикъла и отпечатваме на 
//екрана умножението на числата от 1 до 8
echo 'Факториел на числото 8 (/1*2*3*4*5*6*7*8) е: ' .  $factEight . '<br />';


//Въвеждаме променлива numberTen, което е равно на 10
$numberTen = 10;
//Въвеждаме променлива factTen, което е равно на 1
$factTen = 1;
//Правим проверка докато  числото 10 е по-голямо от 1
while($numberTen > 1){
// да изчисли факториела, тоест умножаваме числото 1 по 10   
    $factTen *= $numberTen;
//Декрементираме броя на итерациите, т.е понижаваме числото с единица,
// т.е става 9 
    $numberTen--;   
}
//Когато приключи проверката, т.е 0>1 излизаме от цикъла и отпечатваме на 
//екрана умножението на числата от 1 до 10
echo 'Факториел на числото 10 (1*2*3*4*5*6*7*8*9*10) е: ' .  $factTen . '<br />';