<?php

// Напишете вложени for цикли, които извеждат следното:
//    *
//    * *
//    * * *
//    * * * *
//    * * * * *
//    * * * * *
//    * * * *
//    * * *
//    * *
//    * 

//Правим цикъл, който отпечатва броя редове
//този цикъл отпечатва горната половина на шаблона
for ($i = 1; $i <= 5; $i++) {
// Правим втори цикъл за отпечатване на spaces
    for($j = 1; $j <=$i; $j++){
//Отпечатваме символа *
        echo  '*' ;
    }
 //Отпечатваме нов ред  
    echo '</br>';
}
//Правим цикъл, който отпечатва броя редове
//този цикъл отпечатва долната половина на шаблона
for ($i = 1; $i <= 5; $i++) {
// Правим втори цикъл за отпечатване на spaces
    for($j = 5; $j >=$i; $j--){
//Отпечатваме символа *
        echo  '*' ;
    }
 //Отпечатваме нов ред  
    echo '</br>';
}
