<?php

//Напишете цикли, които извеждат "триъгълници на Флойд" с 5, 10 и 21 реда. 
//Накратко казано, това са ляво подравнени правоъгълни триъгълници от редове с 
//цели числа, където всеки ред започва с поредното число и съдържа с едно
// число повече от предния ред.
//    Пример - триъгълник с 5 реда изглежда по следния начин:
//    1
//    2 3
//    4 5 6
//    7 8 9 10
//    11 12 13 14 15


//Въвеждаме променлива $number, което е равно на 1
$number = 1;
// Правим цикъл, който отпечатва броя редове
for ($i = 1; $i <= 5; $i++) {
// Правим втори цикъл за отпечатване на spaces
    for($j = 1; $j <=$i; $j++){
//Отпечатваме числата, като инкрементираме броя на итерациите с единица, 
//разделени с интервал
        echo $number++ . " ";
    }
//Отпечатваме нов ред  
    echo  '</br>';   
}
echo '</br>';

//Въвеждаме променлива $number, което е равно на 1
$numberTen = 1;
// Правим цикъл, който отпечатва броя редове
for ($i = 1; $i <= 10; $i++) {
// Правим втори цикъл за отпечатване на spaces
    for($j = 1; $j <=$i; $j++){
//Отпечатваме числата, като инкрементираме броя на итерациите с единица,
//разделени с интервал
        echo $numberTen++ . " ";
    }
//Отпечатваме нов ред  
    echo  '</br>';   
}
echo '</br>';

//Въвеждаме променлива $numberTwentyOne, което е равно на 1
$numberTwentyOne = 1;
// Правим цикъл, който отпечатва броя редове
for ($i = 1; $i <= 21; $i++) {
// Правим втори цикъл за отпечатване на spaces
    for($j = 1; $j <=$i; $j++){
//Отпечатваме числата, като инкрементираме броя на итерациите с единица,
//разделени с интервал
        echo $numberTwentyOne++ . " ";
    }
//Отпечатваме нов ред  
    echo  '</br>';   
}
